# создать файлы 
# 0002_45.psd
# 0002_53.psd
# 0002_55.psd
# 0003_56.psd
# 0003_45.psd
# где 0002 - по порядку до 200 а после _ рандомное число

# их надо перенести в другую папку но при этом создав папку
# Пример:
# создать папку 0002/ и уже сюда должны прилететь 0002_45.psd 0002_53.psd
# 0002_55.psd
# создать папку 0003/ а сюда должны прилететь 0003_45.psd 0003_53.psd
# 0003_55.psd
# for f in {1..200}; do touch "00"$f"_"$RANDOM.txt ; done
#!/bin/bash
FILES="/opt/files/*.psd"
for f in $FILES
do
  echo "Processing $f file..."
  mkdir -p ${f%%_*} 
  cp $f ${f%%_*} 
done
